# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model OPTIMIZED FOR SMALL OBJECTS (BTA)
# Enhanced architecture with P2/4 detection, increased attention, and feature fusion
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scale: s # use scale 's' (width=0.50)
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: ~550 layers, ~3,200,000 parameters, ~8.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: ~550 layers, ~11,500,000 parameters, ~25.0 GFLOPs
  m: [0.50, 1.00, 512] # summary: ~600 layers, ~24,000,000 parameters, ~70.0 GFLOPs
  l: [1.00, 1.00, 512] # summary: ~950 layers, ~32,000,000 parameters, ~95.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: ~950 layers, ~72,000,000 parameters, ~220.0 GFLOPs

# YOLO12 Enhanced Backbone for Small Objects
backbone:
  # [from, repeats, module, args]
  # P1/2 - Initial feature extraction
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2

  # P2/4 - Enhanced for small objects (reduced for memory)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1-P2/4 (reduced from 192 to 128)
  - [-1, 2, A2C2f, [256, True, 1]] # 2-Enhanced attention untuk P2 (c2=256, a2=True, area=1, n=2) - reduced

  # P3/8 - Medium-small objects
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, A2C2f, [512, True, 1]] # 4-Enhanced attention untuk P3 (c2=512, a2=True, area=1, n=2) - reduced

  # P4/16 - Medium objects
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, A2C2f, [512, True, 1]] # 6-Enhanced attention untuk P4 (c2=512, a2=True, area=1, n=2) - reduced

# YOLO12 Enhanced Head for Small Objects (3-scale detection: P2, P3, P4) - P5 removed to save memory
head:
  # Upsample dari P4 ke P3
  - [6, 1, nn.Upsample, [None, 2, "nearest"]] # 7 - start from P4 (layer 6)
  - [[-1, 4], 1, Concat, [1]] # 8 cat backbone P3
  - [-1, 1, Conv, [256, 1, 1]] # 9 Feature fusion layer
  - [-1, 2, A2C2f, [256, True, 1]] # 10 Enhanced processing (c2=256, a2=True, area=1, n=2) - reduced

  # Upsample dari P3 ke P2 (untuk very small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 2], 1, Concat, [1]] # 12 cat backbone P2
  - [-1, 1, Conv, [256, 1, 1]] # 13 Feature fusion layer
  - [-1, 2, A2C2f, [256, True, 1]] # 14 P2/4-xsmall (c2=256, a2=True, area=1, n=2) - reduced

  # Downsample dari P2 ke P3
  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 10], 1, Concat, [1]] # 16 cat head P3 (concat dengan layer 10)
  - [-1, 2, A2C2f, [256, True, 1]] # 17 P3/8-small (c2=256, a2=True, area=1, n=2) - reduced

  # Downsample dari P3 ke P4
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 6], 1, Concat, [1]] # 19 cat head P4 (concat dengan backbone P4 layer 6)
  - [-1, 2, A2C2f, [512, True, 1]] # 20 P4/16-medium (c2=512, a2=True, area=1, n=2) - reduced

  # Detection head dengan 3 skala: P2, P3, P4 (P5 removed to save memory)
  - [[14, 17, 20], 1, Detect, [nc]] # 21 Detect(P2/4, P3/8, P4/16)

