# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model OPTIMIZED FOR SMALL OBJECTS (BTA)
# Enhanced architecture with P2/4 detection, increased attention, and feature fusion
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scale: s # use scale 's' (width=0.50)
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: ~550 layers, ~3,200,000 parameters, ~8.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: ~550 layers, ~11,500,000 parameters, ~25.0 GFLOPs
  m: [0.50, 1.00, 512] # summary: ~600 layers, ~24,000,000 parameters, ~70.0 GFLOPs
  l: [1.00, 1.00, 512] # summary: ~950 layers, ~32,000,000 parameters, ~95.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: ~950 layers, ~72,000,000 parameters, ~220.0 GFLOPs

# YOLO12 Enhanced Backbone for Small Objects
backbone:
  # [from, repeats, module, args]
  # P1/2 - Initial feature extraction
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  
  # P2/4 - Enhanced for small objects (increased channels)
  - [-1, 1, Conv, [192, 3, 2, 1, 2]] # 1-P2/4 (192 channels instead of 128)
  - [-1, 3, A2C2f, [256, True, 4]] # 2-Enhanced attention untuk P2 (c2=256, a2=True, area=4, n=3)
  
  # P3/8 - Medium-small objects
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 3, A2C2f, [512, True, 4]] # 4-Enhanced attention untuk P3 (c2=512, a2=True, area=4, n=3)
  
  # P4/16 - Medium objects
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-Enhanced attention untuk P4 (c2=512, a2=True, area=4, n=4)
  
  # P5/32 - Large objects
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 4]] # 8-Enhanced attention untuk P5 (c2=1024, a2=True, area=4, n=4)
  
  # Multi-scale pooling untuk better feature extraction
  - [-1, 1, SPPF, [1024, 5]] # 9-SPPF (Spatial Pyramid Pooling Fast)

# YOLO12 Enhanced Head for Small Objects (4-scale detection: P2, P3, P4, P5)
head:
  # Upsample dari P5 ke P4
  - [8, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 1, Conv, [512, 1, 1]] # 12 Feature fusion layer
  - [-1, 3, A2C2f, [512, True, 4]] # 13 Enhanced processing (c2=512, a2=True, area=4, n=3)

  # Upsample dari P4 ke P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 1, Conv, [256, 1, 1]] # 16 Feature fusion layer
  - [-1, 4, A2C2f, [256, True, 4]] # 17 P3/8-medium-small (c2=256, a2=True, area=4, n=4) - ENHANCED

  # Upsample dari P3 ke P2 (untuk very small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18
  - [[-1, 2], 1, Concat, [1]] # 19 cat backbone P2
  - [-1, 1, Conv, [256, 1, 1]] # 20 Feature fusion layer
  - [-1, 4, A2C2f, [256, True, 4]] # 21 P2/4-xsmall (c2=256, a2=True, area=4, n=4) - ENHANCED untuk BTA

  # Downsample dari P2 ke P3
  - [-1, 1, Conv, [256, 3, 2]] # 22
  - [[-1, 17], 1, Concat, [1]] # 23 cat head P3
  - [-1, 3, A2C2f, [256, True, 4]] # 24 P3/8-small (c2=256, a2=True, area=4, n=3)

  # Downsample dari P3 ke P4
  - [-1, 1, Conv, [256, 3, 2]] # 25
  - [[-1, 13], 1, Concat, [1]] # 26 cat head P4
  - [-1, 3, A2C2f, [512, True, 4]] # 27 P4/16-medium (c2=512, a2=True, area=4, n=3)

  # Downsample dari P4 ke P5
  - [-1, 1, Conv, [512, 3, 2]] # 28
  - [[-1, 8], 1, Concat, [1]] # 29 cat head P5
  - [-1, 3, A2C2f, [1024, True, 4]] # 30 P5/32-large (c2=1024, a2=True, area=4, n=3)

  # Detection head dengan 4 skala: P2, P3, P4, P5
  - [[21, 24, 27, 30], 1, Detect, [nc]] # 31 Detect(P2/4, P3/8, P4/16, P5/32)

